Repository: Goomba41/work.cgako.spa
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Email with id=%(id)s doesn't exist in database
ru: Электронная почта с id=%(id)s не существует в базе данных

source: Value «%(value)s» from parameter «&user=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&user=%(value)s» не является типом «%(type)s»

source: Add email to user with id=%(id)s is impossible: user is does not exist in database
ru: Невозможно добавить почту пользователю с id=%(id)s: пользователь не существует в базе данных

source: You don't provide user in parameter «&user=», so adding email has been terminated
ru: Вы не отправили пользователя в параметре «&user=», поэтому добавление почты прервано

source: Value «%(value)s» from parameter «&value=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&value=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&value=%(value)s» is out of range 1-100
ru: Значение «%(value)s» параметра «&value=%(value)s» должно быть в пределах 1-100 символов

source: Something's wrong with email «%(value)s» validation: email incorrect or does not exist
ru: Что-то не так с проверкой почты «%(value)s»: неправильный формат или почта не существует

source: Email «%(value)s» already exist in database: email must be unique in entire database
ru: Почта «%(value)s» уже существует в базе данных: почта должна быть уникальна во всей базе данных

source: You don't provide email value in parameter «&value=», so adding email has been terminated
ru: Вы не отправили почту в параметре «&value=», поэтому добавление почты было прервано

source: Value «%(value)s» from parameter «&type=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&type=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&type=%(value)s» is out of range 1-20
ru: Значение «%(value)s» параметра «&type=%(value)s» должно быть в пределах 1-20 символов

source: Value «%(value)s» from parameter «&main=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&main=%(value)s» не является типом «%(type)s»

source: Successfully added email «%(email)s» to user «%(user)s»! Please, check email box for verification mail.
ru: Успешно добавлена почта «%(email)s» пользователю «%(user)s»! Пожалуйста, проверьте почтовый ящик на письмо подтверждения.

source: Success
ru: Успех

source: Email to delete with id=%(value)s is not exist in database
ru: Электронная почта для удаления с id=%(value)s не существует в базе данных

source: Email «%(value)s» successfully deleted from database
ru: Электронная почта «%(value)s» успешно удалена из базы данных

source: Email to update with id=%(id)s is not exist in database
ru: Почта для обновления с id=%(id)s не существует в базе данных

source: Check updated email for confirmation mail!
ru: Проверьте обновленную почту на письмо подтверждения!

source: Email «%(value)s» has been updated!
ru: Почта «%(value)s» изменена!

source: Recipient email with id=%(value)s is does not exist in database
ru: Почта-получатель с id=%(value)s не существует в базе данных

source: Recipient email with id=%(value)s already verified. Request ignored
ru: Почта-получатель с id=%(value)s уже подтверждена. Запрос проигнорирован

source: Mail successfully send to recipient for verification
ru: Письмо успешно отправлено получателю для подтверждения

source: Something went wrong! Mail prepared, but not sent!
ru: Что-то пошло не так! Письмо подготовлено, но не отправлено!

source: Token damaged or expired. Email verification is impossible.
ru: Токен поврежден или просрочен. Подтверждение почты невозможно.

source: Email with id=%(value)s is does not exist in database
ru: Почта с id=%(value)s не существует в базе данных

source: Email with id=%(value)s already verified. Request ignored
ru: Почта с id=%(value)s уже подтверждена. Запрос проигнорирован

source: Email successfully verified! Next verification period begins from %(period)s
ru: Почта успешно подтверждена! Следующий период верификации начинается с %(period)s

source: Module with id=%(id)s doesn't exist in database
ru: Тип модуля с id=%(id)s не существует в базе данных

source: Module type with id=%(id)s doesn't exist in database
ru: Тип модуля с id=%(id)s не существует в базе данных

source: Module to update with id=%(id)s is not exist in database
ru: Модуль для обновления с id=%(id)s не существует в базе данных

source: Value «%(value)s» from parameter «&name=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&name=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&name=%(value)s» is out of range 1-50
ru: Значение «%(value)s» параметра «&name=%(value)s» должно быть в пределах 1-50 символов

source: Value «%(value)s» from parameter «&version=%(value)s» is out of range 1-9
ru: Значение «%(value)s» параметра «&version=%(value)s» должно быть в пределах 1-9 символов

source: Value «%(value)s» from parameter «&version=%(value)s» is not match to <major>.<minor>.<patch> (max 2 digit number)
ru: Значение «%(value)s» параметра «&version=%(value)s» вне формата <major>.<minor>.<patch> (2-х символьные числа)

source: Successfully updated element «%(name)s»
ru: Успешно обновлен элемент «%(name)s»

source: Item «%(name)s» is stay unchanged by one of the reasons: 1. you did not submit data 2. submitted data is the same as old 3. element information update is not allowed
ru: Элемент «%(name)s» остался неизменным по одной из причин: 1. не отправлены данные 2. отправленные данные совпадают с имеющимися 3. обновление информации об элементе запрещено

source: Info
ru: Информация

source: Element with id=%(id)s doesn't exist in database
ru: Элемент с id=%(id)s не существует в базе данных

source: The type submitted in parameter «&type=%(value)s» is does not exist
ru: Тип, отправленный в параметре «&type=%(value)s» не существует в системе

source: The parent submitted in parameter «&parent=%(value)s» is does not exist
ru: Родительский элемент, отправленный в параметре «&parent=%(value)s» не существует в базе данных

source: Element cannot be inserted into parent «%(name)s» with id=%(value)s: parent is the position of the , department or insertion into the parent is prohibited
ru: Элемент не может быть добавлен к элементу «%(name)s» с id=%(value)s: целевой элемент является должностью , или вставка в целевой элемент запрещена

source: Value «%(value)s» from parameter «&name=%(value)s» is out of range 1-100
ru: Значение «%(value)s» параметра «&name=%(value)s» должно быть в пределах 1-100 символов

source: Value «%(value)s» from parameter «&insertable=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&insertable=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&updatable=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&updatable=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&movable=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&movable=%(value)s» не является типом «%(type)s»

source: Value «%(value)s» from parameter «&deletable=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&deletable=%(value)s» не является типом «%(type)s»

source: You cannot insert a new element «%(name)s» under a position «%(parent)s»
ru: Нельзя вставить новый элемент «%(name)s» под должность «%(parent)s»

source: Successfully inserted element «%(name)s» under a element «%(parent)s»
ru: Успешно вставлен элемент «%(name)s» под элемент «%(parent)s»

source: Element «%(name)s» with id=%(id)s is prohibited from deleting
ru: Элемент «%(name)s» с id=%(id)s запрещено удалять

source: Element to delete with id=%(value)s is not exist in database
ru: Элемент для удаления с id=%(value)s не существует в базе данных

source: Root element «%(name)s» cannot be deleted
ru: Корневой элемент «%(name)s» не может быть удален

source: Value «%(value)s» from parameter «&recursive=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&recursive=%(value)s» не является типом «%(type)s»

source: Element «%(name)s» successfully deleted from database with all children elements
ru: Элемент «%(name)s» успешно удален из базы данных вместе со всеми внутреннимиэлементами

source: Element «%(name)s» successfully deleted from database with all children elements. Non deletable childs moved to top level.
ru: Элемент «%(name)s» успешно удален из базы данных со всеми внутренними элементами. Не удаляемые внутренние элементы перемещены на уровень выше

source: Element «%(name)s» successfully deleted from database
ru: Элемент «%(name)s» успешно удален из базы данных

source: Element «%(name)s» successfully deleted from database. All children elements moved to top level
ru: Элемент «%(name)s» успешно удален из базы данных. Все внутренние элементы перемещены на уровень выше

source: Value «%(value)s» from parameter «&parent=%(value)s» is not type of «%(type)s»
ru: Значение «%(value)s» параметра «&parent=%(value)s» не является типом «%(type)s»

source: The target in one of submitted parameter «&parent», «&before», «&after» is does not exist
ru: Целевой элемент в одном из параметров: «&parent», «&before», «&after» не существует в базе данных

source: Unable to move element with id=%(id)s to element with id=%(target_id)s: target element is of type 2 (department position cannot have children) or insertion into target item is not allowed
ru: Невозможно переместить элемент с id=%(id)s в элемент с id=%(target_id)s: целевой элемент является должностью (не может иметь внутренних элементов) или вставка в целевой элемент запрещена

source: Unable to move element with id=%(id)s before or after element with id=%(target_id)s: insertion into target element parent with id=%(target_parent_id)s is not allowed
ru: Невозможно переместить элемент с id=%(id)s на позицию перед или после элемента с id=%(target_id)s: вставка в родителя целевого элемента с id=%(target_parent_id)s запрещена

source: Element to update with id=%(id)s is not exist in database
ru: Элемент для обновления с id=%(id)s не существует в базе данных

source: Root element «%(name)s» cannot be updated
ru: Корневой элемент «%(name)s» не может быть изменен

source: Cannot change type of element with id=%(id)s to type 2 (department position)because he has child elements. Move childelements under other element first.
ru: Невозможно изменить тип элемента с id=%(id)s на должность так как он имеет внутренние элементы. Сначала переместите внутренние элементы в другой элемент.

source: Element «%(name)s» with id=%(id)s is prohibited from moving to another elements
ru: Элемент «%(name)s» с id=%(id)s запрещено перемещать под другие элементы

source: Submitted more than one from parameters: parent,after, before. May be processed only one parameterat time. Please, exclude unnecessary parametersfrom request first.
ru: Отправлен более чем один из параметров: parent, after, before. Возможно обработать только один параметр за запрос. Пожалуйста, исключите ненужные параметры из запроса.

source: Function is bugged, so temporarly does not work
ru: Функция имеет баги, поэтому временно отключена

source: Element «%(name)s» is stay unchanged by one of the reasons: 1. you did not submit data 2. submitted data is the same as old 3. element information update is not allowed
ru: Элемент «%(name)s» остался неизменным по одной из причин: 1. не отправлены данные 2. отправленные данные совпадают с имеющимися 3. обновление информации об элементе запрещено

source: User with id=%(value)s does not exist in database. Please, choose other.
ru: Пользователь с id=%(value)s не существует в базе данных. Пожалуйста, выберите другого.

source: Module with id=%(value)s does not exist in database. Please, choose other.
ru: Модуль с id=%(value)s не существует в базе данных. Пожалуйста, выберите другой.

source: User(%(user)s)->Module(%(module)s) relation already exist in database. Request ignored.
ru: Отношение Пользователь(%(user)s)->Модуль(%(module)s) уже существует в базе данных. Запрос проигнорирован.

source: User(%(user)s)->Module(%(module)s) relation successfully created!
ru: Отношение Пользователь(%(user)s)->Модуль(%(module)s) успешно создано!

source: User(%(user)s)->Module(%(module)s) relation does not exist in database. Request ignored.
ru: Отношение Пользователь(%(user)s)->Модуль(%(module)s) не существует в базе данных. Запрос проигнорирован.

source: User(%(user)s)->Module(%(module)s) relation successfully deleted!
ru: Отношение Пользователь(%(user)s)->Модуль(%(module)s) успешно удалено!

source: Strucure element with id=%(value)s does not exist in database. Please, choose other.
ru: Элемент структуры с id=%(value)s не существует в базе данных. Пожалуйста, выберите другой.

source: User(%(user)s)->Structure element(%(structure)s) relation already exist in database. Request ignored.
ru: Отношение Пользователь(%(user)s)->Элемент структуры(%(structure)s) уже существует в базе данных. Запрос проигнорирован.

source: User(%(user)s)->Structure element(%(structure)s) relation could not be created. User can only be associated with structure type 2 (department position).
ru: Отношение Пользователь(%(user)s)->Элемент структуры(%(structure)s) не может быть создано. Пользователь может быть добавлено только в элемент типа 2 (должность отдела).

source: User(%(user)s)->Module(%(structure)s) relation successfully created!
ru: Отношение Пользователь(%(user)s)->Модуль(%(structure)s) успешно создано!

source: Structure element with id=%(value)s does not exist in database. Please, choose other.
ru: Элемент структуры с id=%(value)s не существует в базе данных. Пожалуйста, выберите другой.

source: User(%(user)s)->Structure element(%(structure)s) relation does not exist in database. Request ignored.
ru: Отношение Пользователь(%(user)s)->Элемент структуры(%(structure)s) не существует в базе данных. Запрос проигнорирован.

source: User(%(user)s)->Module(%(structure)s) relation successfully deleted!
ru: Отношение Пользователь(%(user)s)->Модуль(%(structure)s) успешно удалено!

source: %(num)s year
ru: %(num)s год

source: %(num)s month
ru: %(num)s месяц

source: %(num)s week
ru: %(num)s неделя

source: %(num)s day
ru: %(num)s день

source: %(num)s hour
ru: %(num)s час

source: %(num)s minute
ru: %(num)s минута

source: %(num)s second
ru: %(num)s секунда

source: Error
ru: Ошибка

source: Bad request!
ru: Некорректный запрос!

source: Unauthorized!
ru: Не авторизован!

source: Forbidden
ru: Запрещено

source: Not found!
ru: Не найдено

source: Internal server error!
ru: Внутренняя ошибка сервера

source: Created!
ru: Создано!

source: Warning
ru: Предупреждение

source: Not modified!
ru: Не изменено!

source: I don`t know what to say! Probably thisis test response?
ru: Незнаю, что ответить! Возможно это тестовый запрос?

source: Debugging info is turned off, because incorrect type of parameter 'dbg' (should be boolean)
ru: Отладочная информация отключена из-за некорректного параметра 'dbg' (должен быть типа boolean)

source: Parsing error of list of filters «%(filters)s» from parameter «&filter=%(filters)s». Be sure that fields separated by comma.
ru: Ошибка разбора списка фильтров «%(filters)s» из параметра «&filter=%(filters)s». Убедитесь, что поля разделены запятой.

source: Invalid filter «%(filter)s» (should be «filter=<column>:<operator>:<value>»)
ru: Некорректный фильтр «%(filter)s» (должен быть вида «filter=<столбец>:<оператор>:<значение>»)

source: Invalid filter operator «%(operator)s» (possible variants is: %(variants)s
ru: Некорректный оператор «%(operator)s» в фильтре (возможные варианты: %(variants)s

source: Column «%(column)s» from filter «%(filter)s» doesn't exist in model «%(model)s»
ru: Столбец «%(column)s» из фильтра «%(filter)s» не существует в модели «%(model)s»

source: Error of translating value «%(value)s» to list of values (in case of «in» operator <value> must be string of values, delimited by «,»)
ru: Ошибка трансляции значения «%(value)s» в список значений (в случае «in» оператор <значение> должен быть строковым списком значений, разделенных «,»)

source: Error of translating filter operator «%(op)s»
ru: Ошибка трансляции оператора «%(op)s» в фильтре

source: Parsing error of list of orderings «%(value)s» from parameter «&order_by=%(value)s». Be sure that fields separated by comma.
ru: Ошибка разбора списка сортировок «%(value)s» из параметра «&order_by=%(value)s». Убедитесь, что поля разделены запятой.

source: Invalid order parameter «%(value)s» (should be«order_by=<column>:<direction>»)
ru: Некорректный параметр сортировки «%(value)s» (должен быть вида «order_by=<столбец>:<направление_сортировки>»)

source: Invalid order direction «%(direction)s» in order parameter «%(order)s» (possible variants is: «acs», «desc»)
ru: Некорректное направление сортировки «%(direction)s» в параметре сортировки «%(order)s» (возможные варианты: «acs» (возр.), «desc» (убыв.))

source: Column «%(column)s» from order parameter «%(order)s» doesn't exist in model «%(model)s»
ru: Стобец «%(column)s» из параметра сортировки «%(order)s» не существует в модели «%(model)s»

source: Error of translating order by operator «%(operator)s»
ru: Ошибка трансляции оператора сортировки «%(operator)s»

source: Parsing error of list of columns «%(only)s» from parameter «&columns=%(only)s». Be sure that fields separated by comma.
ru: Ошибка разбора списка столбцов «%(only)s» из параметра «&columns=%(only)s». Убедитесь, что поля разделены запятой.

source: Column «%(items)s» from column parameter «&column=%(columns)s» doesn't exist in model «%(model)s»
ru: Столбец «%(items)s» из параметра столбцов «&column=%(columns)s» не существует в модели «%(model)s»

source: Parsing error of list of exclusions «%(items)s» from parameter «&exclude=%(items)s». Be sure that fields separated by comma.
ru: Ошибка разбора списка исключений «%(items)s» из параметра «&exclude=%(items)s». Убедитесь, что поля разделены запятой.

source: Column «%(column)s» from exclude parameter «&exclude=%(items)s» doesn't exist in model «%(model)s»
ru: Столбец «%(column)s» из параметра исключений «&exclude=%(items)s» не существует в модели «%(model)s
